# 1. 다음 선언 된 변수에 대하여 각 명령을 수행하는 코드를 작성하시오.
x = 1
y = 2

"""
1). 두 수의 합을 구하여 print 하시오.

2). 두 수의 차를 구하여 print 하시오.

3). x에서 y를 나눈 나머지를 print 하시오.
"""


# 2.  다음 선언 된 변수에 대하여 각 명령을 수행하는 코드를 작성하시오.
a = 5
b = 2

"""
1). 다음을 연산하는 코드를 작성하시오.
(a + b) X (a / b)

2). 1)의 결과에서 소수점을 제거하시오.

3). 1)의 결과를 3으로 나눈 나머지를 구하시오.
"""


# 3. 다음 문자열에 대해 각 명령을 수행하는 코드를 작성하시오.
a = "No pain, no gain"

"""
1). 해당 문자열에서 n의 개수를 print 하시오.

2). 해당 문자열에서 no를 yes로 치환하여 print 하시오.

3). 해당 문자열의 길이를 print 하시오.

4). 해당 문자열에서 쉼표의 앞 부분만 print 하시오.
"""


# 4. 제곱미터를 입력받아 평수를 계산하는 코드를 작성하시오.
a = 22
